{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.1.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/transpose_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/Conv2D_transpose_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3136"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_0/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/Conv2D", "op": "Conv2D", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/transpose_3"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/jit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/Conv2D", "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/jit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/avg_pool", "op": "AvgPool", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Maximum"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/avg_pool", "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/Conv2D_transpose_3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/jit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/Conv2D", "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Maximum_1", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/jit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/avg_pool_1", "op": "AvgPool", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Maximum_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/avg_pool_1", "StatefulPartitionedCall/jax2tf_apply_/CNN/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_0/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Reshape", "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_0/jit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_0/MatMul", "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_0/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Maximum_2", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_0/jit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Maximum_2", "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_1/jit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_1/MatMul", "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_1/jit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/transpose_3", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_0/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/Conv2D_transpose_3", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Conv_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast_1", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "shape": [3136, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_0/Reshape", "shape": [1, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/jit_relu_/jit__lambda__/Cast_2", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp", "shape": [256, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/CNN/Dense_1/Reshape", "shape": [1, 10], "dtype": "float32"}]}]}